Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxMinimcds_bf.h
/** \brief Mask for Ifx_MINIMCDS_TCX_AC_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_AC_RNG_RANGE_MSK (0x3fffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_AC_RNG_RANGE_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_MSK_Bits.SVM */
#define IFX_MINIMCDS_TCX_AC_MSK_SVM_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_MSK_Bits.SVM */
#define IFX_MINIMCDS_TCX_AC_MSK_SVM_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_MSK_Bits.SVM */
#define IFX_MINIMCDS_TCX_AC_MSK_SVM_OFF (0u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_MSK_Bits.MASTER */
#define IFX_MINIMCDS_TCX_AC_MSK_MASTER_LEN (4u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_MSK_Bits.MASTER */
#define IFX_MINIMCDS_TCX_AC_MSK_MASTER_MSK (0xfu)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_MSK_Bits.MASTER */
#define IFX_MINIMCDS_TCX_AC_MSK_MASTER_OFF (1u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_MSK_Bits.SUBCHANNEL */
#define IFX_MINIMCDS_TCX_AC_MSK_SUBCHANNEL_LEN (7u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_MSK_Bits.SUBCHANNEL */
#define IFX_MINIMCDS_TCX_AC_MSK_SUBCHANNEL_MSK (0x7fu)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_MSK_Bits.SUBCHANNEL */
#define IFX_MINIMCDS_TCX_AC_MSK_SUBCHANNEL_OFF (5u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_MSK_Bits.WR */
#define IFX_MINIMCDS_TCX_AC_MSK_WR_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_MSK_Bits.WR */
#define IFX_MINIMCDS_TCX_AC_MSK_WR_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_MSK_Bits.WR */
#define IFX_MINIMCDS_TCX_AC_MSK_WR_OFF (12u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_MSK_Bits.RD */
#define IFX_MINIMCDS_TCX_AC_MSK_RD_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_MSK_Bits.RD */
#define IFX_MINIMCDS_TCX_AC_MSK_RD_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_MSK_Bits.RD */
#define IFX_MINIMCDS_TCX_AC_MSK_RD_OFF (13u)

/** \brief Length for Ifx_MINIMCDS_TCX_AC_MSK_Bits.MSK */
#define IFX_MINIMCDS_TCX_AC_MSK_MSK_LEN (1u)

/** \brief Mask for Ifx_MINIMCDS_TCX_AC_MSK_Bits.MSK */
#define IFX_MINIMCDS_TCX_AC_MSK_MSK_MSK (0x1u)

/** \brief Offset for Ifx_MINIMCDS_TCX_AC_MSK_Bits.MSK */
#define IFX_MINIMCDS_TCX_AC_MSK_MSK_OFF (14u)

/** \brief Length for Ifx_MINIMCDS_TCX_IP_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_IP_BND_BOUND_LEN (31u)

/** \brief Mask for Ifx_MINIMCDS_TCX_IP_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_IP_BND_BOUND_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_IP_BND_Bits.BOUND */
#define IFX_MINIMCDS_TCX_IP_BND_BOUND_OFF (1u)

/** \brief Length for Ifx_MINIMCDS_TCX_IP_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_IP_RNG_RANGE_LEN (31u)

/** \brief Mask for Ifx_MINIMCDS_TCX_IP_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_IP_RNG_RANGE_MSK (0x7fffffffu)

/** \brief Offset for Ifx_MINIMCDS_TCX_IP_RNG_Bits.RANGE */
#define IFX_MINIMCDS_TCX_IP_RNG_RANGE_OFF (1u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXMINIMCDS_BF_H */
